<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/pandas9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
school_id_list =[
    {'name':'John','job':'teacher','age':40},
    {'name':'Nate','job':'teacher','age':35},
    {'name':'Yuna','job':'teacher','age':37},
    {'name':'Abraham','job':'student','age':10},
    {'name':'Brian','job':'student','age':12},
    {'name':'Janny','job':'student','age':11},
    {'name':'Nate','job':'teacher','age':None},
    {'name':'John','job':'student','age':None},
    
]
df=pd.DataFrame(school_id_list,columns = ['name','job','age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

데이터의 형태 파악 8개의 열과 3개의 행

In [ ]:
df.shape

(8, 3)

None 값 확인하기

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [ ]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

'age'라는 column에서 None 값 확인될 시 0으로 변환

In [ ]:
df.age=df.age.fillna(0)

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [ ]:
school_id_list =[
    {'name':'John','job':'teacher','age':40},
    {'name':'Nate','job':'teacher','age':35},
    {'name':'Yuna','job':'teacher','age':37},
    {'name':'Abraham','job':'student','age':10},
    {'name':'Brian','job':'student','age':12},
    {'name':'Janny','job':'student','age':11},
    {'name':'Nate','job':'teacher','age':None},
    {'name':'John','job':'student','age':None},
    
]
df=pd.DataFrame(school_id_list,columns = ['name','job','age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

None을 column별 median 값으로 변환

In [ ]:
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace=True)

In [ ]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0